app/controllers/school_classes_controller.rb

def create
  @school_class = SchoolClass.new
  @school_class.title = params[:title]
  @school_class.room_number = params[:room_number]
  @school_class.save
---
INSERT INTO "school_classes" DEFAULT VALUES