app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2018-08-03 14:13:02.075283"], ["updated_at", "2018-08-03 14:13:02.075283"]]
---
def create
  @student = Student.new
  @Student.first_name = params[:first_name]
  @student.last_name = params[:last_name]
  @student.save

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2018-08-03 14:04:33.027999"], ["id", 1]]
---
def update
  @student = Student.find(params[:id])
  @Student.update(params.require(:student))